Revit 2024 API
ExternalDataInstanceRemovingFromDocumentEventArgs.TypeId Property
 The type id of the external data instance id being removed from Revit document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId TypeId { get; }
Visual Basic
Public ReadOnly Property TypeId As ElementId
	Get
Visual C++
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
See Also
ExternalDataInstanceRemovingFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace